{
  "valentine": [
    "Love is in the air... or maybe that's just your WiFi acting up again.",
    "You will meet someone special soon. Or at least someone who shares their Netflix password.",
    "Your soulmate is out there. They're probably just stuck in traffic.",
    "Someone secretly loves you. It’s either your crush or your Uber driver.",
    "Roses are red, violets are blue, someone is swiping right on you!",
    "Love yourself first. Then go buy yourself some tacos. Priorities.",
    "Your next date will be magical. Or at least involve free food.",
    "They say money can’t buy love, but it can buy pizza, which is close enough.",
    "Love is patient, love is kind. But if they take more than 3 hours to text back, block them.",
    "Your love life is heating up... unlike your leftovers, which you forgot in the microwave.",
    "Someone has a crush on you. It might be your cat, though.",
    "You will soon receive a romantic message. It’s probably just a scam email, but hey, it’s something.",
    "Your ex will regret losing you. Just keep being awesome.",
    "Valentine’s Day is just another Wednesday. Keep calm and order takeout.",
    "You deserve flowers and chocolate. Buy them for yourself, because self-love is key.",
    "Cupid’s arrow is coming your way. Hopefully, it has good aim this time.",
    "Your next great romance starts... right after your nap.",
    "Love is like WiFi: sometimes strong, sometimes weak, and sometimes it just disappears completely.",
    "If love were a GPA, yours is about to be a 4.0.",
    "You are someone’s dream person. Unfortunately, they’re in a different time zone.",
    "You’re cute. You should hear that more often. Screenshot this for later.",
    "The right person will love you for who you are. Until then, enjoy your snacks.",
    "Romance is coming your way. Hope you like romantic walks to the fridge.",
    "Your future holds love and adventure. Or at least a really good meme.",
    "A great love story awaits you. Hopefully, it’s not directed by M. Night Shyamalan.",
    "Your soulmate is looking for you. Too bad they’re using Apple Maps.",
    "You’ll soon get flowers. Whether they’re from a secret admirer or the grocery store, who knows?",
    "Love is about to knock on your door. Hopefully, it doesn’t require a signature.",
    "Your crush will notice you soon. Or at least like one of your old posts by accident.",
    "Valentine’s Day advice: If they don’t text back, send memes until they do.",
    "A surprise date is in your future. Even if it’s just with your pillow.",
    "Be careful who you text ‘I miss you’ to. Spell check won’t save you from bad decisions.",
    "You’ll have a passionate romance. Hopefully, with someone who understands your meme references.",
    "Your love life is like a mystery novel: confusing but entertaining.",
    "Someone is thinking of you right now. Hopefully, it’s not your ex.",
    "If love is a battlefield, you’re winning. Or at least not losing too badly.",
    "You will soon get butterflies in your stomach. Could be love, could be Taco Bell. Proceed with caution.",
    "A great romance is coming. Might be a rom-com, but at least it’ll be fun.",
    "If they don’t hype you up like a concert crowd, they’re not the one.",
    "Your love story is loading... please do not unplug.",
    "Relationship status: Loading… might need an update.",
    "You will receive an unexpected gift soon. It might just be a spam email, but still.",
    "You deserve the world. Until then, at least a solid playlist and good WiFi.",
    "A mysterious admirer will appear soon. Or maybe just a random bot in your DMs.",
    "Your next love story will be epic. Or at least have fewer red flags.",
    "Trust the timing of your life. Love arrives when your WiFi signal is strongest.",
    "If they can’t handle you at your worst, screenshot and send it to the group chat for roasting.",
    "Your heart will soon race. Hopefully, it’s love and not just too much coffee.",
    "Your flirting game is on point. Now if only you’d use it in real life.",
    "Self-love is the best love. But, like, a cute date wouldn’t hurt.",
    "If love were a subject, you’d be acing it. Extra credit for kindness and good vibes.",
    "Your dream partner is out there. Probably asleep, just like you should be.",
    "Your heart is golden. Now find someone who won’t treat it like spare change.",
    "Love yourself like Kanye loves Kanye.",
    "Someone will soon confess their love for you. If not, at least your dog still likes you.",
    "A magical connection is on the horizon. Or maybe that’s just your phone charger lighting up.",
    "You are about to have a legendary love story. If not, at least a really good snack.",
    "You’re the main character. Act like it.",
    "Love is like a WiFi signal. If it’s weak, move on to a better connection.",
    "A secret admirer is watching you... hopefully, not in a creepy way.",
    "You have a heart of gold. Don’t let clowns turn it into fool’s gold.",
    "Your love life is like a TikTok trend—unexpected, but entertaining.",
    "You will be loved deeply. Just don’t fall for someone who still uses ‘lol’ in every text.",
    "If they wanted to, they would. Keep that in mind.",
    "Your true love is closer than you think. Check your ‘Recently Contacted’ list.",
    "Love is a journey. Buckle up, and don’t pick up any emotional hitchhikers.",
    "Your charm is undeniable. Even your phone autocorrects ‘alone’ to ‘awesome’."
  ]
}